org/robotics_probabilistic_generative_laws.org
:PROPERTIES:
:ID:       c147b46d-f3ae-4d36-b1a4-d3f3e83495b3
:END:
#+title: Robotics Probabilistic Generative Laws
#+hugo_tags: robotics

* Notation
- $x_t$ :: world state at time $t$
- $z_t$ :: measurement data at time $t$ (e.g. camera images)
- $u_t$ :: control data (change of state in the environment) at time
  $t$

* State Evolution

\begin{equation}
  p(x_t | x_{0:t-1} z_{1:t-1}, u_{1:t})
\end{equation}

* State Transition Probability

\begin{equation}
  p(x_t | x_{0:t-1} z_{1:t-1}, u_{1:t}) = p ( x_t | x_{t-1}, u_t)
\end{equation}

The world state at the previous time-step is a sufficient summary of
all that happened in previous time-steps.

* Measurement Probability

\begin{equation}
  p(z_t | x_{0:t}, z_{1:t-1}, u_{1:t}) = p(z_t | x_t)
\end{equation}

The measurement at time-step $t$ is often just a noisy projection of
the world state at time-step $t$.
